2020.02.25.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-02-25 Tue 08:23 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OCaml Weekly News</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">OCaml Weekly News</h1>
<p>
<a href="http://alan.petitepomme.net/cwn/2020.02.18.html">Previous Week</a> <a href="http://alan.petitepomme.net/cwn/index.html">Up</a> <a href="http://alan.petitepomme.net/cwn/2020.03.03.html">Next Week</a>
</p>

<p>
Hello
</p>

<p>
Here is the latest OCaml Weekly News, for the week of February 18 to 25, 2020.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#1">Dune 2.3.0</a></li>
<li><a href="#2">What's the OCaml equivalent for HLint?</a></li>
<li><a href="#3">Training Sessions for "Expert OCaml" in Paris</a></li>
<li><a href="#4">OCaml 4.10 released</a></li>
<li><a href="#orgddcae24">Old CWN</a></li>
</ul>
</div>
</div>


<div id="outline-container-org344f71e" class="outline-2">
<h2 id="1">Dune 2.3.0</h2>
<div class="outline-text-2" id="text-1">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ann-dune-2-3-0/5184/1">https://discuss.ocaml.org/t/ann-dune-2-3-0/5184/1</a>
</p>
</div>

<div id="outline-container-org922e23b" class="outline-3">
<h3 id="org922e23b">Rudi Grinberg announced</h3>
<div class="outline-text-3" id="text-org922e23b">
<p>
On behalf of the dune team, I'm proud to announce the 2.3.0 release of dune. This release is particularly relevant for users of coq that use dune to build their theories, developers of coq that use dune to build their favorite theorem
prover. I'd like to thank @ejgallego for all the hard work to improve dune in this regard.
</p>

<p>
I'd also like to point out the <code>(strict_package_deps)</code> option that is now available in project files. This option will now ask dune to validate the package dependencies specified in the <code>package</code> stanzas in your dune-project files.
</p>

<p>
Here's the full change list, and as always, happy hacking!
</p>
</div>

<div id="outline-container-orga77768a" class="outline-4">
<h4 id="orga77768a">2.3.0 (15/02/2020)</h4>
<div class="outline-text-4" id="text-orga77768a">
<ul class="org-ul">
<li>Improve validation and error handling of arguments to <code>dune init</code> (#3103, fixes
#3046, @shonfeder)</li>

<li><code>dune init exec NAME</code> now uses the <code>NAME</code> argument for private modules (#3103,
fixes #3088, @shonfeder)</li>

<li>Avoid linear walk to detect children, this should greatly improve
performance when a target has a large number of dependencies (#2959,
@ejgallego, @aalekseyev, @Armael)</li>

<li>[coq] Add <code>(boot)</code> option to <code>(coq.theories)</code> to enable bootstrap of
Coq's stdlib (#3096, @ejgallego)</li>

<li>[coq] Deprecate <code>public_name</code> field in favour of <code>package</code> (#2087, @ejgallego)</li>

<li>Better error reporting for "data only" and "vendored" dirs. Using these with
anything else than a strict subdirectory or <code>*</code> will raise an error. The
previous behavior was to just do nothing  (#3056, fixes #3019, @voodoos)</li>

<li>Fix bootstrap on bytecode only switches on windows or where <code>-j1</code> is set.
(#3112, @xclerc, @rgrinberg)</li>

<li>Allow <code>enabled_if</code> fields in <code>executable(s)</code> stanzas (#3137, fixes #1690
@voodoos)</li>

<li>Do not fail if <code>ocamldep</code>, <code>ocamlmklib</code>, or <code>ocaml</code> are absent. Wait for them
to be used to fail (#3138, @rgrinberg)</li>

<li>Introduce a <code>strict_package_deps</code> mode that verifies that dependencies between
packages in the workspace are specified correctly. (@rgrinberg, #3117)</li>

<li>Make sure the <code>@all</code> alias is defined when no <code>dune</code> file is present
in a directory (#2946, fix #2927, @diml)</li>
</ul>
</div>
</div>
</div>
</div>




<div id="outline-container-orgbf7026c" class="outline-2">
<h2 id="2">What's the OCaml equivalent for HLint?</h2>
<div class="outline-text-2" id="text-2">
<p>
Archive: <a href="https://discuss.ocaml.org/t/whats-the-ocaml-equivalent-for-hlint/5167/3">https://discuss.ocaml.org/t/whats-the-ocaml-equivalent-for-hlint/5167/3</a>
</p>
</div>

<div id="outline-container-org6d267da" class="outline-3">
<h3 id="org6d267da">Continuing this thread, Stéphane Lavergne said</h3>
<div class="outline-text-3" id="text-org6d267da">
<p>
Aside from Mascot and <code>ppx_js_style</code>, it seems that <a href="https://github.com/OCamlPro/typerex-lint">ocp-lint</a> is actively maintained by the folks at OcamlPro. I personally only use <code>ocamlformat</code> so I can't vouch for it, but it seems
promising.
</p>
</div>
</div>
</div>




<div id="outline-container-org667db2e" class="outline-2">
<h2 id="3">Training Sessions for "Expert OCaml" in Paris</h2>
<div class="outline-text-2" id="text-3">
<p>
Archive: <a href="https://sympa.inria.fr/sympa/arc/caml-list/2020-02/msg00032.html">https://sympa.inria.fr/sympa/arc/caml-list/2020-02/msg00032.html</a>
</p>
</div>

<div id="outline-container-org3cbbc26" class="outline-3">
<h3 id="org3cbbc26">Laurène Gibaud announced</h3>
<div class="outline-text-3" id="text-org3cbbc26">
<p>
OCamlPro organizes a cross-company training in French for developers who
already use OCaml. The "Expert OCaml" training mixes theory and practice
and will allow you to master OCaml's advanced features such as its
type-system, OCaml's open source tools and libraries, and how to write
compact and efficient code.
</p>

<p>
When? The next session is scheduled for March 3-4, 2020, the second will be
on April 7-8, 2020.
</p>

<p>
Where? Paris 14, at our office
</p>

<p>
If interested, contact us at contact@ocamlpro.com or register on:
<a href="http://www.ocamlpro.com/forms/preinscriptions-formation-ocaml/">http://www.ocamlpro.com/forms/preinscriptions-formation-ocaml/</a>.
We can also organize custom and on-site sessions upon request.
</p>

<p>
More info on: <a href="http://www.ocamlpro.com/training-ocamlpro/">http://www.ocamlpro.com/training-ocamlpro/</a>
</p>
</div>
</div>
</div>




<div id="outline-container-org2aa633b" class="outline-2">
<h2 id="4">OCaml 4.10 released</h2>
<div class="outline-text-2" id="text-4">
<p>
Archive: <a href="https://discuss.ocaml.org/t/ocaml-4-10-released/5194/1">https://discuss.ocaml.org/t/ocaml-4-10-released/5194/1</a>
</p>
</div>

<div id="outline-container-org119623a" class="outline-3">
<h3 id="org119623a">octachron announced</h3>
<div class="outline-text-3" id="text-org119623a">
<p>
We have the pleasure of celebrating the birthday of Francis Ronalds
by announcing the release of OCaml version 4.10.0.
</p>

<p>
Some of the highlights in this release are:
</p>

<ul class="org-ul">
<li>A new best-fit allocator for the major heap which reduces both GC cost an
memory usage.</li>
<li>Some preliminary runtime work for OCaml multicore</li>
<li>Immutable strings are now enforced at configuration time</li>
<li>User-defined indexing operators for multidimensional arrays</li>
<li>Coming soon: statmemprof, a new statistical memory profiler.
The external API will be release next version.</li>
<li>Various improvements to the manual</li>
<li>More precise exhaustiveness check for GADTs</li>
<li>Many bug fixes</li>
</ul>

<p>
Merlin, the OCaml editor service, is not yet available for this release.
We will publish a follow-up announcement when Merlin is ready.
</p>

<p>
This release is (or soon will be) available as a set of OPAM switches,
and as a source download here:
</p>

<p>
<a href="https://caml.inria.fr/pub/distrib/ocaml-4.10/">https://caml.inria.fr/pub/distrib/ocaml-4.10/</a>
</p>

<p>
Editor note: please follow the archive link for the full changelog
</p>
</div>
</div>
</div>




<div id="outline-container-orgddcae24" class="outline-2">
<h2 id="orgddcae24">Old CWN</h2>
<div class="outline-text-2" id="text-orgddcae24">
<p>
If you happen to miss a CWN, you can <a href="mailto:alan.schmitt@polytechnique.org">send me a message</a> and I'll mail it to you, or go take a look at <a href="http://alan.petitepomme.net/cwn/">the archive</a> or the <a href="http://alan.petitepomme.net/cwn/cwn.rss">RSS feed of the archives</a>.
</p>

<p>
If you also wish to receive it every week by mail, you may subscribe <a href="http://lists.idyll.org/listinfo/caml-news-weekly/">online</a>.
</p>

<div class="authorname">
<p>
<a href="http://alan.petitepomme.net/">Alan Schmitt</a>
</p>

</div>
</div>
</div>
</div>
</body>
</html>
